1 Tree map, 1 Area chart and 1 stacked area chart using python

In [34]:
import os
import pandas as pd

In [43]:
data_path = ('C:\\Users\\saman\\git_repos\\dsc640-data_presentation\\data\\ex3.2')
exp_file = f"{data_path}\expenditures.txt"
df_expn = pd.read_csv(exp_file,sep='\t',header=0)
df_expn

     year             category  expenditure  sex
0    2008                 Food         6443    1
1    2008  Alcoholic Beverages          444    1
2    2008              Housing        17109    1
3    2008              Apparel         1801    1
4    2008       Transportation         8604    1
..    ...                  ...          ...  ...
345  1984            Education          303    1
346  1984     Tobacco Products          228    1
347  1984        Miscellaneous          451    1
348  1984   Cash Contributions          706    1
349  1984   Personal Insurance         1897    1

[350 rows x 4 columns]

In [57]:
data_path = "C:\\Users\\saman\\git_repos\\dsc640-data_presentation\\data\\ex3.2"
exp_file = f"{data_path}\\unemployement-rate-1948-2010.csv"
# print(exp_file)
df_unemp = pd.read_csv(exp_file,sep=',',header=0)
df_unemp

       Series id  Year Period  Value
0    LNS14000000  1948    M01    3.4
1    LNS14000000  1948    M02    3.8
2    LNS14000000  1948    M03    4.0
3    LNS14000000  1948    M04    3.9
4    LNS14000000  1948    M05    3.5
..           ...   ...    ...    ...
741  LNS14000000  2009    M10   10.1
742  LNS14000000  2009    M11   10.0
743  LNS14000000  2009    M12   10.0
744  LNS14000000  2010    M01    9.7
745  LNS14000000  2010    M02    9.7

[746 rows x 4 columns]